; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=147, out_folder=./training, instance_id=9, seed=2033, goal_proportion=0.03

(define (problem blocksworld-09)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 - object)
 (:init 
    (arm-empty)
    (clear b39)
    (on b39 b80)
    (on b80 b102)
    (on b102 b46)
    (on b46 b53)
    (on-table b53)
    (clear b12)
    (on-table b12)
    (clear b36)
    (on b36 b11)
    (on b11 b87)
    (on b87 b22)
    (on-table b22)
    (clear b75)
    (on b75 b132)
    (on b132 b54)
    (on b54 b4)
    (on-table b4)
    (clear b86)
    (on b86 b31)
    (on b31 b69)
    (on-table b69)
    (clear b19)
    (on b19 b35)
    (on b35 b65)
    (on b65 b88)
    (on b88 b92)
    (on b92 b134)
    (on b134 b120)
    (on-table b120)
    (clear b129)
    (on b129 b109)
    (on-table b109)
    (clear b70)
    (on b70 b105)
    (on b105 b79)
    (on-table b79)
    (clear b126)
    (on b126 b118)
    (on b118 b55)
    (on b55 b111)
    (on b111 b10)
    (on b10 b68)
    (on b68 b74)
    (on b74 b44)
    (on b44 b58)
    (on b58 b135)
    (on b135 b95)
    (on b95 b45)
    (on-table b45)
    (clear b14)
    (on b14 b18)
    (on b18 b144)
    (on b144 b73)
    (on b73 b146)
    (on b146 b76)
    (on b76 b121)
    (on-table b121)
    (clear b83)
    (on b83 b96)
    (on b96 b122)
    (on b122 b9)
    (on b9 b30)
    (on b30 b145)
    (on b145 b113)
    (on-table b113)
    (clear b107)
    (on b107 b17)
    (on-table b17)
    (clear b78)
    (on b78 b26)
    (on b26 b71)
    (on b71 b90)
    (on b90 b25)
    (on b25 b85)
    (on-table b85)
    (clear b56)
    (on b56 b52)
    (on b52 b116)
    (on b116 b67)
    (on-table b67)
    (clear b3)
    (on b3 b133)
    (on b133 b137)
    (on b137 b131)
    (on b131 b60)
    (on b60 b37)
    (on-table b37)
    (clear b112)
    (on b112 b142)
    (on b142 b119)
    (on-table b119)
    (clear b7)
    (on b7 b59)
    (on-table b59)
    (clear b114)
    (on b114 b6)
    (on b6 b103)
    (on b103 b8)
    (on b8 b139)
    (on b139 b2)
    (on b2 b40)
    (on b40 b141)
    (on b141 b84)
    (on b84 b23)
    (on-table b23)
    (clear b77)
    (on b77 b140)
    (on-table b140)
    (clear b63)
    (on b63 b43)
    (on-table b43)
    (clear b110)
    (on b110 b104)
    (on b104 b42)
    (on b42 b93)
    (on b93 b62)
    (on-table b62)
    (clear b82)
    (on b82 b117)
    (on b117 b21)
    (on b21 b89)
    (on-table b89)
    (clear b91)
    (on b91 b66)
    (on-table b66)
    (clear b38)
    (on-table b38)
    (clear b50)
    (on b50 b29)
    (on-table b29)
    (clear b97)
    (on-table b97)
    (clear b108)
    (on b108 b128)
    (on-table b128)
    (clear b125)
    (on b125 b136)
    (on-table b136)
    (clear b72)
    (on b72 b138)
    (on b138 b5)
    (on b5 b48)
    (on-table b48)
    (clear b24)
    (on b24 b13)
    (on b13 b98)
    (on b98 b15)
    (on b15 b41)
    (on-table b41)
    (clear b130)
    (on b130 b20)
    (on b20 b1)
    (on b1 b47)
    (on-table b47)
    (clear b51)
    (on b51 b143)
    (on b143 b124)
    (on b124 b127)
    (on-table b127)
    (clear b57)
    (on-table b57)
    (clear b16)
    (on-table b16)
    (clear b28)
    (on b28 b81)
    (on b81 b115)
    (on-table b115)
    (clear b64)
    (on-table b64)
    (clear b123)
    (on b123 b33)
    (on b33 b32)
    (on b32 b99)
    (on-table b99)
    (clear b61)
    (on b61 b100)
    (on b100 b94)
    (on b94 b147)
    (on b147 b49)
    (on b49 b101)
    (on b101 b27)
    (on b27 b34)
    (on-table b34)
    (clear b106)
    (on-table b106))
 (:goal  (and 
    (clear b2)
    (on b2 b4)
    (on b4 b3)
    (on-table b3)
    (clear b1)
    (on-table b1))))

; plan
1. (unstack b3 b133)
   deleted: (on b3 b133) (clear b3) (arm-empty)
   added: (holding b3) (clear b133)
   goals met: 0 of 6
2. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 6
3. (unstack b114 b6)
   deleted: (on b114 b6) (clear b114) (arm-empty)
   added: (holding b114) (clear b6)
   goals met: 1 of 6
4. (putdown b114)
   deleted: (holding b114)
   added: (clear b114) (arm-empty) (on-table b114)
   goals met: 1 of 6
5. (unstack b130 b20)
   deleted: (on b130 b20) (clear b130) (arm-empty)
   added: (holding b130) (clear b20)
   goals met: 1 of 6
6. (putdown b130)
   deleted: (holding b130)
   added: (clear b130) (arm-empty) (on-table b130)
   goals met: 1 of 6
7. (unstack b20 b1)
   deleted: (on b20 b1) (clear b20) (arm-empty)
   added: (holding b20) (clear b1)
   goals met: 2 of 6
8. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 2 of 6
9. (unstack b1 b47)
   deleted: (on b1 b47) (clear b1) (arm-empty)
   added: (holding b1) (clear b47)
   goals met: 1 of 6
10. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 3 of 6
11. (unstack b6 b103)
   deleted: (on b6 b103) (clear b6) (arm-empty)
   added: (holding b6) (clear b103)
   goals met: 3 of 6
12. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 3 of 6
13. (unstack b103 b8)
   deleted: (on b103 b8) (clear b103) (arm-empty)
   added: (holding b103) (clear b8)
   goals met: 3 of 6
14. (putdown b103)
   deleted: (holding b103)
   added: (clear b103) (arm-empty) (on-table b103)
   goals met: 3 of 6
15. (unstack b75 b132)
   deleted: (on b75 b132) (clear b75) (arm-empty)
   added: (holding b75) (clear b132)
   goals met: 3 of 6
16. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 3 of 6
17. (unstack b132 b54)
   deleted: (on b132 b54) (clear b132) (arm-empty)
   added: (holding b132) (clear b54)
   goals met: 3 of 6
18. (putdown b132)
   deleted: (holding b132)
   added: (clear b132) (arm-empty) (on-table b132)
   goals met: 3 of 6
19. (unstack b54 b4)
   deleted: (on b54 b4) (clear b54) (arm-empty)
   added: (holding b54) (clear b4)
   goals met: 3 of 6
20. (putdown b54)
   deleted: (holding b54)
   added: (clear b54) (arm-empty) (on-table b54)
   goals met: 3 of 6
21. (unstack b8 b139)
   deleted: (on b8 b139) (clear b8) (arm-empty)
   added: (holding b8) (clear b139)
   goals met: 3 of 6
22. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 3 of 6
23. (unstack b139 b2)
   deleted: (on b139 b2) (clear b139) (arm-empty)
   added: (holding b139) (clear b2)
   goals met: 4 of 6
24. (putdown b139)
   deleted: (holding b139)
   added: (clear b139) (arm-empty) (on-table b139)
   goals met: 4 of 6
25. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 4 of 6
26. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 5 of 6
27. (unstack b2 b40)
   deleted: (on b2 b40) (clear b2) (arm-empty)
   added: (holding b2) (clear b40)
   goals met: 4 of 6
28. (stack b2 b4)
   deleted: (clear b4) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b4)
   goals met: 6 of 6
